name: "onnx"
platform: "onnxruntime_onnx"
max_batch_size: 8

input [
  {
    name: "candidate_tokens"
    data_type: TYPE_INT64
    dims: [ -1 ]
  },
  {
    name: "history_tokens"
    data_type: TYPE_INT64
    dims: [ -1, -1 ]
  }
]

output [
  {
    name: "score"
    data_type: TYPE_FP32
    reshape: { shape: [ ] }
    dims: [ 1 ]
  }
]

instance_group [
  { kind: KIND_GPU count: 1 }
]

dynamic_batching {
  preferred_batch_size: [ 1, 4, 8 ]
  max_queue_delay_microseconds: 100
}